#list: a=['2','a','s2']
#tuple: a=('3','4','d')
#dict: a={'m':34,'d':32,'r':90,'er':10}
#set: a=set([2,3,5,2])
#**********************************************************************************************************************************************#

#list
classmate=['lisa','anna','yifen','lumingfei']#python内置的数据类型 list,可以随时添加和删除其中的元素
classmate[0]#list的第一个数据
classmate[-1]#list的倒数第一个
classmate.append('师姐')#在list后面添加一个数据
classmate.insert(2,'楚子航')#指定位置插入数据
classmate.pop(0)#删除第一个数据，如果是classmate.pop()为直接删除最后一个元素
classmate[0]='路明泽'#直接赋值对应索引位置，将其替换
L=['Let up across hell and reach to heaven!',123,False]#list里的元素可以不是同一种类型
s=[12,2,True,['生如夏花，开到颓靡','one'],'go']#list元素可以是另一个list,里面只有5个元素，
print(s[3][0])#与二维数组相似

#————————————————————————————————————————————————————————————————————————————————————————————————————#手动分界线

#tuple
t=('凡是王血，必以剑终','say hihi')#与list相似，t这是个tuple（元组）内容不可改变，没有append（），insert（）这种方法，元组只要定义下，元素就被确定
tt=()#定义了一个空元组
tt1=(1)#这定义了一个数，而非元组，须在1后加个’，‘
tt2=(1,)#定义了只有一个元素的元组

#————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————#

#“可变”的tuple
w=('are','you','ok?',['I am fine','No, fuck you'])#tuple中含有list,list里面的元素可以改变，其他的不行.append(),insert()这些函数只对里面的list有用，可以用

#——————————————————————————————————————————————————————————————————————————————————————————————————————————————#
#练习
LL=[
    ['apple','goole','microsoft'],
    ['java','python','ruby','php'],
    ['adam','bart','lisa']
]
print(LL[0][0]
      ,LL[1][1]
      ,LL[2][2])
#——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————#
age=90
if age<18:                  #m每次if或者else都要有：，空格四个为一个语句块
    print('TM他是个未成年,打*他，他%d'%age)
elif age>60:            #else if可以简写elif
    print('old man 一边玩去')
else:
    print('大爷快来玩呀')

s=input('birth:')   #input()返回的数据类型是str字符串，（）内的字符是输入提示
birth=int(s)        #将str字符串类型转换成整数
if birth<2000:
    print('90后人上人',birth)
else:
    print('小小蛋蛋后%d'%birth)

#————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————#

#循环:python 有两种循环，一种是for...in循环，另一种是while循环

for x in classmate:    #for...in循环，将list或者tuple中的每一个元素迭代出来
    print(x)           #就是将in之后的每个元素代入变量X，然后进行缩进块的语句

sum=0
for x1 in  range(101):  #range(x)为函数，生成小于x的整数数列
    sum = sum + x1
print(sum)

sum=0
n=5
while n>0:  #while循环，满足n>0的循环条件，循环就不短
    sum+=n
    n-=2
print(sum)

n=1
while n<100:#break:跳出循环                                                         #强制退出程序：ctr+c
    n=n+1
    if n==10:
        break
    print(n)
while n<20:#continue：跳过当前循环，开启下次循环
    n=n+1
    if n>13:
        continue
    print(n)

#——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————#

#使用dict和set

d={'mimi':99,'mama':100,'shiwo':101}#list是[],tuple是 （），dict是{}；一个key有对应的value
print(d['mimi'])
d['mimi']=10086     #除了初始化指定外，还可以指定key放入value。多次放入value，会把前面的冲掉，只留最新的
print('mimi' in d)                    #可以通过 in判断key是否存在,返回bool
print(d.get('mim'))                   #也可以通过dict提供的方法get()，如果key不存在，返回None,或者自己指定的value
print(d.get('mii','ok'))
d.pop('mama')                         #pop(key),删除key，及其对应value

#dict的key必须是不可变量，字符串，整数等都可以做key,但是list不能作为key

#与dict相似。有key但是没有value,且key不会重复
s=set([1,2,5,7,1,2,66,3])      #要创建一个set,需要提供一个list作为输入合集,在set内会被重新排序
print(s)
s.add(4)                        #添加一个元素，且可以重复添加一个相同的数，虽然输出出来没啥变化
s.remove(66)                    #删除一个key
k=set([0,22,11])
print(s&k,s|k)                  #两个set的交集和并集

#再议不可变对象

a=['s','a','f','g']
a.sort()                  #排序
print(a)
a='abcd'
b=a.replace('c','cccccc')       #替换，其实不是，只是换了指向对象
print(b,a)

